test/artillery/kudos/kudos-add.yaml
config:
  target: "http://localhost:6500"
  processor: "../helpers/kudos-payload.js"
  phases:    
    - duration: 60
      arrivalRate: 2
      rampTo: 5
scenarios:
  - name: "Kudos Add"
    flow:
      - function: "generateRandomPayload"
      - post:
          url: "/api/kudos/add"
          json: "{{payload}}"