test/artillery/kudos/kudos-list.yaml
config:
  target: "http://localhost:6500"
  processor: "../helpers/kudos-payload.js"
  phases:    
    - duration: 60
      arrivalRate: 2
      rampTo: 5
scenarios:
  - name: "Kudos List"
    flow:
      - function: "generateRandomPagination"
      - get:
          url: "/api/kudos/list?pageSize={{pageSize}}&startPage={{startPage}}"